app/controllers/bucket_items_controller.rb

INSERT INTO "bucket_items" ("content", "bucket_list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "First bucket List Item"], ["bucket_list_id", 3], ["created_at", "2015-08-29 22:58:59.029128"], ["updated_at", "2015-08-29 22:58:59.029128"]]
---
	def create
		@bucket_item = @bucket_list.bucket_items.create(bucket_item_params)

SELECT  "bucket_items".* FROM "bucket_items" WHERE "bucket_items"."bucket_list_id" = $1 AND "bucket_items"."id" = $2 LIMIT 1  [["bucket_list_id", 1], ["id", 4]]
DELETE FROM "bucket_items" WHERE "bucket_items"."id" = $1  [["id", 4]]
---
	def destroy
		@bucket_item = @bucket_list.bucket_items.find(params[:id])
		if @bucket_item.destroy

UPDATE "bucket_items" SET "completed_at" = $1, "updated_at" = $2 WHERE "bucket_items"."id" = $3  [["completed_at", "2015-08-30 01:31:13.043161"], ["updated_at", "2015-08-30 01:31:13.043840"], ["id", 6]]
---
	def complete
		@bucket_item.update_attribute(:completed_at, Time.now)

SELECT  "bucket_lists".* FROM "bucket_lists" WHERE "bucket_lists"."id" = $1 LIMIT 1  [["id", 3]]
---
	def set_bucket_list
		@bucket_list = BucketList.find(params[:bucket_list_id])

SELECT  "bucket_items".* FROM "bucket_items" WHERE "bucket_items"."bucket_list_id" = $1 AND "bucket_items"."id" = $2 LIMIT 1  [["bucket_list_id", 1], ["id", 6]]
---
	def set_bucket_item
		@bucket_item = @bucket_list.bucket_items.find(params[:id])