app/controllers/bucket_lists_controller.rb

SELECT "bucket_lists".* FROM "bucket_lists"
---
    def index
        @bucket_lists = BucketList.all

INSERT INTO "bucket_lists" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "First List"], ["description", "Test"], ["created_at", "2015-08-29 21:06:18.338984"], ["updated_at", "2015-08-29 21:06:18.338984"]]
---
    def create
        @bucket_list = BucketList.new(bucket_list_params)

        respond_to do |format|
            if @bucket_list.save

UPDATE "bucket_lists" SET "description" = $1, "updated_at" = $2 WHERE "bucket_lists"."id" = $3  [["description", "sfsdfsdfdfsdfsd"], ["updated_at", "2015-08-31 10:31:04.970693"], ["id", 4]]
---
    def update
        respond_to do |format|
            if @bucket_list.update(bucket_list_params)

DELETE FROM "bucket_lists" WHERE "bucket_lists"."id" = $1  [["id", 2]]
---
    def destroy
        @bucket_list.destroy

SELECT  "bucket_lists".* FROM "bucket_lists" WHERE "bucket_lists"."id" = $1 LIMIT 1  [["id", 4]]
---
    def set_bucket_list
        @bucket_list = BucketList.find(params[:id])